---
kind: method
id: M:Autodesk.Revit.DB.Macros.MacroManager.GetMacroManager(Autodesk.Revit.DB.Document)
source: html/e230f53e-de22-47e0-4539-5bf5ba88e473.htm
---
# Autodesk.Revit.DB.Macros.MacroManager.GetMacroManager Method

Gets the Macro manager from the document.

## Syntax (C#)
```csharp
public static MacroManager GetMacroManager(
	Document document
)
```

## Parameters
- **document** (`Autodesk.Revit.DB.Document`) - The document.

## Returns
The new Macro manager object.

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null